Autodesk.Revit.DB.LevelAssociationData.GetLevelOffset
Returns the offset from the Associated Level.
Since:
2022

Autodesk.Revit.DB.LevelAssociationData.SetLevelOffset(System.Double)
Sets the offset from the Associated Level.
offset:
The offset from the Level.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2022

Autodesk.Revit.DB.LevelAssociationData.SetAssociatedLevel(Autodesk.Revit.DB.ElementId)
Sets the Associated Level.
levelId:
The id of the Level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2022

Autodesk.Revit.DB.LevelAssociationData.GetAssociatedLevel
Returns the Associated Level id.
Since:
2022

Autodesk.Revit.DB.LevelAssociationData
This class holds information related to Level.
Since:
2022